{
   "class_name": "Functional",
   "config": {
      "name": "psp_dcblstm_model",
      "layers": [
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  700
               ],
               "dtype": "float32",
               "sparse": false,
               "ragged": false,
               "name": "main_input"
            },
            "name": "main_input",
            "inbound_nodes": []
         },
         {
            "class_name": "Embedding",
            "config": {
               "name": "embedding",
               "trainable": true,
               "batch_input_shape": [
                  null,
                  700
               ],
               "dtype": "float32",
               "input_dim": 21,
               "output_dim": 21,
               "embeddings_initializer": {
                  "class_name": "RandomUniform",
                  "config": {
                     "minval": -0.05,
                     "maxval": 0.05,
                     "seed": null
                  }
               },
               "embeddings_regularizer": null,
               "activity_regularizer": null,
               "embeddings_constraint": null,
               "mask_zero": false,
               "input_length": 700
            },
            "name": "embedding",
            "inbound_nodes": [
               [
                  [
                     "main_input",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  700,
                  21
               ],
               "dtype": "float32",
               "sparse": false,
               "ragged": false,
               "name": "aux_input"
            },
            "name": "aux_input",
            "inbound_nodes": []
         },
         {
            "class_name": "Concatenate",
            "config": {
               "name": "concatenate",
               "trainable": true,
               "dtype": "float32",
               "axis": -1
            },
            "name": "concatenate",
            "inbound_nodes": [
               [
                  [
                     "embedding",
                     0,
                     0,
                     {}
                  ],
                  [
                     "aux_input",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1",
               "trainable": true,
               "dtype": "float32",
               "filters": 64,
               "kernel_size": [
                  3
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "groups": 1,
               "activation": "relu",
               "use_bias": 1,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1",
            "inbound_nodes": [
               [
                  [
                     "concatenate",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv2",
               "trainable": true,
               "dtype": "float32",
               "filters": 128,
               "kernel_size": [
                  3
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "groups": 1,
               "activation": "relu",
               "use_bias": 1,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv2",
            "inbound_nodes": [
               [
                  [
                     "concatenate",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv3",
               "trainable": true,
               "dtype": "float32",
               "filters": 256,
               "kernel_size": [
                  3
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "groups": 1,
               "activation": "relu",
               "use_bias": 1,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv3",
            "inbound_nodes": [
               [
                  [
                     "concatenate",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batchNorm_1",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": 1,
               "scale": 1,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batchNorm_1",
            "inbound_nodes": [
               [
                  [
                     "conv1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batchNorm_2",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": 1,
               "scale": 1,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batchNorm_2",
            "inbound_nodes": [
               [
                  [
                     "conv2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batchNorm_3",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": 1,
               "scale": 1,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batchNorm_3",
            "inbound_nodes": [
               [
                  [
                     "conv3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.3,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout",
            "inbound_nodes": [
               [
                  [
                     "batchNorm_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_1",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.3,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_1",
            "inbound_nodes": [
               [
                  [
                     "batchNorm_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_2",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.3,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_2",
            "inbound_nodes": [
               [
                  [
                     "batchNorm_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Concatenate",
            "config": {
               "name": "concatenate_1",
               "trainable": true,
               "dtype": "float32",
               "axis": -1
            },
            "name": "concatenate_1",
            "inbound_nodes": [
               [
                  [
                     "dropout",
                     0,
                     0,
                     {}
                  ],
                  [
                     "dropout_1",
                     0,
                     0,
                     {}
                  ],
                  [
                     "dropout_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Bidirectional",
            "config": {
               "name": "blstm1",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "LSTM",
                  "config": {
                     "name": "lstm",
                     "trainable": true,
                     "dtype": "float32",
                     "return_sequences": 1,
                     "return_state": 0,
                     "go_backwards": 0,
                     "stateful": false,
                     "unroll": 0,
                     "time_major": 0,
                     "units": 200,
                     "activation": "tanh",
                     "recurrent_activation": "sigmoid",
                     "use_bias": 1,
                     "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                           "seed": null
                        },
                        "shared_object_id": 33
                     },
                     "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                           "gain": 1.0,
                           "seed": null
                        },
                        "shared_object_id": 34
                     },
                     "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {},
                        "shared_object_id": 35
                     },
                     "unit_forget_bias": true,
                     "kernel_regularizer": null,
                     "recurrent_regularizer": null,
                     "bias_regularizer": null,
                     "activity_regularizer": null,
                     "kernel_constraint": null,
                     "recurrent_constraint": null,
                     "bias_constraint": null,
                     "dropout": 0.5,
                     "recurrent_dropout": 0.5,
                     "implementation": 1
                  }
               },
               "merge_mode": "concat"
            },
            "name": "blstm1",
            "inbound_nodes": [
               [
                  [
                     "concatenate_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Bidirectional",
            "config": {
               "name": "blstm2",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "LSTM",
                  "config": {
                     "name": "lstm_1",
                     "trainable": true,
                     "dtype": "float32",
                     "return_sequences": 1,
                     "return_state": 0,
                     "go_backwards": 0,
                     "stateful": false,
                     "unroll": 0,
                     "time_major": 0,
                     "units": 200,
                     "activation": "tanh",
                     "recurrent_activation": "sigmoid",
                     "use_bias": 1,
                     "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                           "seed": null
                        },
                        "shared_object_id": 39
                     },
                     "recurrent_initializer": {
                        "class_name": "Orthogonal",
                        "config": {
                           "gain": 1.0,
                           "seed": null
                        },
                        "shared_object_id": 40
                     },
                     "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {},
                        "shared_object_id": 41
                     },
                     "unit_forget_bias": true,
                     "kernel_regularizer": null,
                     "recurrent_regularizer": null,
                     "bias_regularizer": null,
                     "activity_regularizer": null,
                     "kernel_constraint": null,
                     "recurrent_constraint": null,
                     "bias_constraint": null,
                     "dropout": 0.5,
                     "recurrent_dropout": 0.5,
                     "implementation": 1
                  }
               },
               "merge_mode": "concat"
            },
            "name": "blstm2",
            "inbound_nodes": [
               [
                  [
                     "blstm1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Concatenate",
            "config": {
               "name": "concatenate_2",
               "trainable": true,
               "dtype": "float32",
               "axis": -1
            },
            "name": "concatenate_2",
            "inbound_nodes": [
               [
                  [
                     "blstm1",
                     0,
                     0,
                     {}
                  ],
                  [
                     "blstm2",
                     0,
                     0,
                     {}
                  ],
                  [
                     "concatenate_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_3",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.3,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_3",
            "inbound_nodes": [
               [
                  [
                     "concatenate_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "TimeDistributed",
            "config": {
               "name": "dense1",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "Dense",
                  "config": {
                     "name": "dense1",
                     "trainable": true,
                     "dtype": "float32",
                     "units": 100,
                     "activation": "relu",
                     "use_bias": true,
                     "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                           "seed": null
                        }
                     },
                     "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                     },
                     "kernel_regularizer": null,
                     "bias_regularizer": null,
                     "activity_regularizer": null,
                     "kernel_constraint": null,
                     "bias_constraint": null
                  }
               }
            },
            "name": "dense1",
            "inbound_nodes": [
               [
                  [
                     "dropout_3",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_4",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.3,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_4",
            "inbound_nodes": [
               [
                  [
                     "dense1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "TimeDistributed",
            "config": {
               "name": "dense2",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "Dense",
                  "config": {
                     "name": "dense2",
                     "trainable": true,
                     "dtype": "float32",
                     "units": 100,
                     "activation": "relu",
                     "use_bias": true,
                     "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                           "seed": null
                        }
                     },
                     "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                     },
                     "kernel_regularizer": null,
                     "bias_regularizer": null,
                     "activity_regularizer": null,
                     "kernel_constraint": null,
                     "bias_constraint": null
                  }
               }
            },
            "name": "dense2",
            "inbound_nodes": [
               [
                  [
                     "dropout_4",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dropout",
            "config": {
               "name": "dropout_5",
               "trainable": true,
               "dtype": "float32",
               "rate": 0.3,
               "noise_shape": null,
               "seed": null
            },
            "name": "dropout_5",
            "inbound_nodes": [
               [
                  [
                     "dense2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "TimeDistributed",
            "config": {
               "name": "main_output",
               "trainable": true,
               "dtype": "float32",
               "layer": {
                  "class_name": "Dense",
                  "config": {
                     "name": "main_output",
                     "trainable": true,
                     "dtype": "float32",
                     "units": 8,
                     "activation": "softmax",
                     "use_bias": true,
                     "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                           "seed": null
                        }
                     },
                     "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                     },
                     "kernel_regularizer": null,
                     "bias_regularizer": null,
                     "activity_regularizer": null,
                     "kernel_constraint": null,
                     "bias_constraint": null
                  }
               }
            },
            "name": "main_output",
            "inbound_nodes": [
               [
                  [
                     "dropout_5",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         }
      ],
      "input_layers": [
         [
            "main_input",
            0,
            0
         ],
         [
            "aux_input",
            0,
            0
         ]
      ],
      "output_layers": [
         [
            "main_output",
            0,
            0
         ]
      ]
   },
   "keras_version": "2.7.0",
   "backend": "tensorflow"
}